
/* Задание1:
Напишите программу, которая выводит строку «Hello World!»  в консоль.
 */

public class Task01 {
    public static void main(String[] args) {
        System.out.println("Hellow World!");
    }
}
